import Article from "./article";

const articlesRepository = [
    new Article( "React", "JavaScript-библиотека для создания пользовательских интерфейсов"),
    new Article( "Angular", "Angular — это открытая и свободная платформа для разработки веб-приложений, написанная на языке TypeScript, разрабатываемая командой из компании Google."),
    new Article( "Asp.Net", "ASP.NET — платформа разработки веб-приложений, в состав которой входит: веб-сервисы, программная инфраструктура, модель программирования, от компании Майкрософт"),
    new Article( "Php", "PHP — скриптовый язык общего назначения, интенсивно применяемый для разработки веб-приложений."),
    new Article( "NodeJs", "ode или Node.js — программная платформа, основанная на движке V8, превращающая JavaScript из узкоспециализированного языка в язык общего назначения.")

];

export default articlesRepository;
